app/controllers/admin/users_controller.rb

SELECT  `users`.* FROM `users` LIMIT 10 OFFSET 0
---
	def index
   	 @q = SearchParams.new(params[:search_params] || {})
   	 @users = User.default_where(@q.attributes(self)).page(params[:page]).per(10)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
    def edit
     @html_title = "Edit user"
     @user =  User.find(params[:id])

INSERT INTO `users` (`name`, `email`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('jamst@qq.com', 'jamst@qq.com', '$2a$10$wwfAEppGpmbyDt5ZSKKXrOJwTngKxlJwzxeiu9uIqLjIy1qEx8GWu', '2017-11-08 22:37:41', '2017-11-08 22:37:41')
---
    def create
      @user = User.new(user_params)
      @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `name` = 'jamst1@qq.com', `email` = 'jamst1@qq.com', `updated_at` = '2017-11-08 22:40:23' WHERE `users`.`id` = 1
---
    def update
      @user = User.find(params[:id])
      @user.update(user_params)