app/controllers/web/sessions_controller.rb

SELECT  `customers`.* FROM `customers` WHERE `customers`.`name` = '2017111221252158539088877365' LIMIT 1
---
  def create
    resource = warden.authenticate!(scope: resource_name, recall: "#{controller_path}#new")
    set_flash_message(:notice, :signed_in) if is_navigational_format?
    sign_in(resource_name, resource)
    # resource.ensure_private_token!
    respond_to do |format|
      cu = Customer.find_by(name:cookies[:opxPID])