app/views/web/center/index.html.erb

SELECT `customers`.* FROM `customers` WHERE `customers`.`user_id` = 1
---
                  <ul class="am-list">
                    <% current_user.customers_vendors.each do |cv| %>