app/views/customers/show.html.erb

SELECT `vendors`.* FROM `vendors` INNER JOIN `customers_vendors` ON `vendors`.`id` = `customers_vendors`.`vendor_id` WHERE `customers_vendors`.`customer_id` = 1
---
           <h3>他关注过的店：</h3>
        <% @customer.vendors.each do |vendor| %>