app/views/vendors/_add_comments.html.erb

<ul class="am-list">
  <% @vendor.comments&.order(id:"desc").each do |comment| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`vendor_id` = 2 ORDER BY `comments`.`id` DESC