app/views/vendors/_form.html.erb

SELECT `categories`.* FROM `categories`
---
    <div class="controls">
      <%= f.select :category_id, options_for_select(Category.all.collect { |p| [ p.name, p.id ] }, @vendor.category_id), {include_blank: true}, {class: 'form-control input-sm ui dropdown', style: 'width: 280px;' } %>