app/controllers/customers_controller.rb

  def show
    if params[:from_id]
      cv = CustomerVisit.find_or_create_by(from_id:params[:from_id],to_id:params[:to_id])
      cv.update(view_count:cv.view_count.to_i + 1)
---
INSERT INTO `customer_visits` (`from_id`, `to_id`, `created_at`, `updated_at`) VALUES (1, 1, '2017-11-01 22:41:09', '2017-11-01 22:41:09')
SELECT  `customer_visits`.* FROM `customer_visits` WHERE `customer_visits`.`from_id` = 1 AND `customer_visits`.`to_id` = 1 LIMIT 1
UPDATE `customer_visits` SET `view_count` = 2, `updated_at` = '2017-11-01 22:42:18' WHERE `customer_visits`.`id` = 1

  def create
    require 'exifr/jpeg'
    @customer = Customer.find_or_create_by(name:cookies[:opxPID])
    if current_user.present?
      @customer.user_id = current_user.id
      @customer.save!
    end
    unless params[:draft_img].blank?
      attachment = Attachment.create(attachment_entity_type: "Customer",attachment_entity_id: @customer.id , path: params[:draft_img], created_by: 1 )
      path = "#{Rails.root}/public#{attachment.path.to_s}"
      exif = EXIFR::JPEG.new(path)
      @latitude = exif.gps&.latitude||39.9717219722
      @longitude = exif.gps&.longitude||116.4911780001
      gps = GpsLocation.create(customer_id:@customer.id,latitude:@latitude,longitude:@longitude,cover_img:attachment.id)
---
INSERT INTO `customers` (`name`, `created_at`, `updated_at`) VALUES ('jamst', '2017-11-01 22:11:43', '2017-11-01 22:11:43')
SELECT  `customers`.* FROM `customers` WHERE `customers`.`name` = 'jamst' LIMIT 1
INSERT INTO `attachments` (`attachment_entity_type`, `attachment_entity_id`, `path`, `name`, `content_type`, `file_size`, `created_by`, `created_at`, `updated_at`) VALUES ('Customer', 1, '001.jpg', '001.jpg', 'image/jpeg', 4317088, '1', '2017-11-01 22:11:43', '2017-11-01 22:11:43')
INSERT INTO `gps_locations` (`id`, `latitude`, `longitude`, `customer_id`, `created_at`, `updated_at`) VALUES (1, '30.618017277777778', '114.34549633333333', 1, '2017-11-01 22:11:43', '2017-11-01 22:11:43')

    def set_customer
      @customer = params[:id] ? Customer.find(params[:id]) : Customer.new(name:cookies[:opxPID])
---
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = NULL LIMIT 1