app/controllers/trackings_controller.rb

    cache_array("uuids_list",cookies[:opxPID],"uniq")

    # 当前用户关联
    opxid = Customer.find_by(name:cookies[:opxPID])
---
SELECT  `customers`.* FROM `customers` WHERE `customers`.`name` = '2017111221252158539088877365' LIMIT 1