app/controllers/vendors_controller.rb

SELECT  `vendors`.* FROM `vendors` ORDER BY `vendors`.`id` DESC LIMIT 1
---
  def index
    @vendors = Vendor.all

INSERT INTO `comments` (`content`, `vendor_id`, `created_at`, `updated_at`) VALUES ('123', 2, '2017-10-29 10:00:09', '2017-10-29 10:00:09')
---
  def add_comments
    Comment.create(vendor_id:@vendor.id,content:params[:comment_text])

UPDATE `vendors` SET `view_count` = 2, `updated_at` = '2017-10-29 09:58:32' WHERE `vendors`.`id` = 2
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = NULL LIMIT 1
INSERT INTO `customers_vendors` (`customer_id`, `vendor_id`, `created_at`, `updated_at`) VALUES (1, 2, '2017-11-01 22:17:31', '2017-11-01 22:17:31')
SELECT  `customers_vendors`.* FROM `customers_vendors` WHERE `customers_vendors`.`customer_id` = 1 AND `customers_vendors`.`vendor_id` = 2 LIMIT 1
UPDATE `customers_vendors` SET `view_count` = 2, `updated_at` = '2017-11-01 22:24:54' WHERE `customers_vendors`.`id` = 1
---
  def show
    @vendor.update(view_count: @vendor.view_count.to_i + 1)

    if params[:customer_id]
      @customer = Customer.find(params[:customer_id])
      cv = CustomersVendor.find_or_create_by(customer_id:params[:customer_id],vendor_id:@vendor.id)
      cv.update(view_count:cv.view_count.to_i + 1)

SELECT  `attachments`.* FROM `attachments` WHERE `attachments`.`id` = 2 LIMIT 1
---
  def show_gps
    require 'exifr/jpeg'
    @image = Attachment.find(params[:id])

INSERT INTO `vendors` (`title`, `name`, `content`, `created_at`, `updated_at`) VALUES ('test', 'test', '<p>23432432</p><p><br></p>', '2017-10-29 09:54:51', '2017-10-29 09:54:51')
INSERT INTO `attachments` (`attachment_entity_type`, `attachment_entity_id`, `path`, `name`, `content_type`, `file_size`, `created_by`, `created_at`, `updated_at`) VALUES ('vendor', 2, '001.jpg', '001.jpg', 'image/jpeg', 4317088, '1', '2017-10-29 09:57:52', '2017-10-29 09:57:52')
---
  def create
    @vendor = Vendor.new(vendor_params)
    respond_to do |format|
      if @vendor.save
        unless params[:draft_img].blank?
          attachment = Attachment.create(attachment_entity_type: "vendor",attachment_entity_id: @vendor.id , path: params[:draft_img], created_by: 1 )

INSERT INTO `attachments` (`attachment_entity_type`, `path`, `name`, `content_type`, `file_size`, `created_by`, `created_at`, `updated_at`) VALUES ('vendor', '8553802714712733.png', '8553802714712733.png', 'image/png', 16191, '1', '2017-10-29 09:57:48', '2017-10-29 09:57:48')
---
  def upload_image
    attachment = Attachment.create(attachment_entity_type: "vendor", path: params[:wang_editor_file], created_by: 1 )

SELECT  `vendors`.* FROM `vendors` WHERE `vendors`.`id` = 2 LIMIT 1
---
    def set_vendor
      @vendor = Vendor.find(params[:id])